/* `welcomeLabel` UILabel text default value */
"Welcome" = "Vitajte";

/* `thankyouLabel` UILabel text default value */
"ThankyouMessage" = "Ďakujeme za prevzatie";

/* `instructionTextView` UITextView text default value with \".notConfigurated\" state */
"WelcomeInstruction" = "Ak chcete spustiť proces aktivácie, postupujte podľa pokynov, ktoré ste dostali v uvítacej e-mailovej správe.";

/* `instructionTextView` UITextView text default value with \".isConfigured\" state */
"ConfiguredInstruction" = "Sledujte riadenie vašich každodenných úloh a jednoducho spolupracujte na projektoch.";

"ScanInstruction" = "Ak chcete spustiť proces aktivácie, naskenujte bezpečnostný QR kód.";

"DiscoveryServiceInstruction" = "Zadajte svoju e-mailovú adresu a spustite proces aktivácie.";

/* checking the account(email address) user entered in discovery service */
"CheckingAccountKey" = "Kontroluje sa konto...";

/* `signInButton` UIButton's titleLabel?.text default value */
"SignIn" = "Spustiť";

"Scan" = "Skenovať";

/* `demoLabel` UILabel text default value */
"Explore" = "Chcete preskúmať?";

/* `demoButton` UIButton's titleLabel?.text default value */
"TryDemo" = "Skúste predvádzaciu verziu";

/* The title for the passcode setup screens. */
"SetPasscodeKey" = "Nastaviť prístupový kód";

/* The title for the enter passcode screen. */
"PasscodeKey" = "Prístupový kód";

/* The title for the Choose Passcode screen. */
"ChoosePasscodeTitleKey" = "Zvoliť prístupový kód";

/* The title for the Confirm Passcode screen. */
"ConfirmPasscodeTitleKey" = "Potvrdiť kód";

/* The message on the confirm passcode screen for passcode setup. */
"EnterPasscodeAgainKey" = "Znova zadajte prístupový kód.";

/* The message on the confirm passcode screen for passcode change. */
"ConfirmPasscodeKey" = "Potvrďte prístupový kód.";

/* The message on the input passcode screen. */
"EnterYourPasscodeKey" = "Zadajte prístupový kód.";

/* The title for the passcode change screens. */
"ChangePasscodeKey" = "Zmeniť prístupový kód";

/* The message on the input passcode screen in change passcode. */
"EnterYourCurrentPasscodeKey" = "Zadajte aktuálny prístupový kód.";

/* The button title string used both in passcode and\n touch ID screens to indicate not to setup now. */
"NotNowKey" = "Nie teraz";

/* The button title string used on the second passcode setup\n to go back to the first screen. */
"BackKey" = "Späť";

/* The button title string used on the first passcode setup\n to go to the next screen. */
"NextKey" = "Ďalej";

/* The button title string used on the passcode input screen (not in the change passcode sequence)\n When the passcode input screen is in the change passcode sequence, the button title should be changed \"Next\" */
"DoneKey" = "Hotovo";

/* The main message format on the setup passscode screen.\n The %d will display the number of characters required from\n the passcode policy. */
"PasscodeChooseMinCharKey" = "Zvoľte prístupový kód s minimálne %d znakmi pre odomknutie aplikácie.";

/* The main message format on the setup passscode screen when the\n isDititsOnly property of the passcode policy is true.\n The %d will display the number of digits required from\n the passcode policy. */
"PasscodeChooseMinDigitKey" = "Zvoľte prístupový kód s minimálne %d číslicami pre odomknutie aplikácie.";

/* The message for passcode to include the required character groups\n when passcode policy requires it. */
"PasscodeRequiredGroupKey" = "Zahrňte nasledujúce:";

/* The group name for lower case letters. */
"LowerCaseKey" = "Malé písmeno (a-z)";

/* The group name for upper case letters. */
"UpperCaseKey" = "Veľké písmeno (A-Z)";

/* The group name for digits. */
"DigitsKey" = "Číslice (0-9)";

/* The group name for non-alphabetic characters. */
"Non-alphaKey" = "Symboly (!@#...)";

/* The button title for resetting passcode. */
"ResetPasscodeKey" = "Obnoviť prístupový kód";

/* Alert message when validate method of FUIPasscodeValidationDelegate\n returning false for the passcode user entered in setup passcode. */
"PasscodeValidationFailedKey" = "Overenie prístupového kódu zlyhalo.";

/* Alert message when the passcode user entered was rejected by\n the FUIPasscodeControllerDelegate's shouldTryPasscode function. */
"PasscodeRejectedKey" = "Prístupový kód bol zamietnutý FUIPasscodeControllerDelegate.";

/* The alert button title used on passcode validation failed, or passcode rejected. */
"RetryKey" = "Znova";

/* The title for setup touch ID screen. */
"TouchIDKey" = "Touch ID";

/* The title for setup touch ID screen. */
"FaceIDKey" = "Face ID";

/* This is to be used combined with \"Touch ID\" or \"Face ID\", e.g., \"Touch ID is now available!\" */
"IsNowAvailableKey" = " je teraz k dispozícii!";

/* The first paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage1Key" = "Aktivácia Touch ID vám umožní rýchlejší prístup k vašim informáciám.";

/* The second paragraph of the message on the Touch ID screen when no Touch ID is enrolled on device. */
"TouchIDMessage2Key" = "Túto funkciu môžete kedykoľvek zapnúť alebo vypnúť v časti Nastavenia.";

/* The first paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage1Key" = "Ak chcete získať rýchly a bezpečný prístup, aktivujte Touch ID.";

/* The second paragraph of the message on the Touch ID screen when Touch ID is enrolled on device. */
"TouchIDEnableMessage2Key" = "Ak je Touch ID deaktivované, budete požiadaný o zadanie prístupového kódu zariadenia.";

/* The first paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage1Key" = "Aktivácia Face ID vám umožní rýchlejší prístup k vašim informáciám.";

/* The second paragraph of the message on the Face ID screen when no Touch ID is enrolled on device. */
"FaceIDMessage2Key" = "Túto funkciu môžete kedykoľvek zapnúť alebo vypnúť v časti Nastavenia.";

/* The first paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage1Key" = "Ak chcete získať rýchly a bezpečný prístup, aktivujte Face ID.";

/* The second paragraph of the message on the Face ID screen when Touch ID is enrolled on device. */
"FaceIDEnableMessage2Key" = "Ak je Face ID deaktivované, budete požiadaný o zadanie prístupového kódu zariadenia.";

/* The alert title to ask user add fingerprints to use Touch ID. */
"UseTouchIDTitleKey" = "Ak chcete použiť Touch ID, pridajte odtlačky prstov do nastavení zariadenia.";

/* The alert message to ask user add fingerprints to use Touch ID. */
"UseTouchIDMessageKey" = "Môžete to urobiť kedykoľvek v časti Nastavenia - Touch ID a Prístupový kód.";

/* The alert title to ask user add fingerprints to use Face ID. */
"UseFaceIDTitleKey" = "Ak chcete použiť Face ID, zaregistrujte sa v nastaveniach zariadenia Face ID.";

/* The alert message to ask user add fingerprints to use Face ID. */
"UseFaceIDMessageKey" = "Môžete to urobiť kedykoľvek v časti Nastavenia - Face ID a Prístupový kód.";

/* The message for the link on the Touch ID screen. */
"LearnMoreKey" = "Ďalšie informácie o Touch ID";

/* The message for the link on the Face ID screen. */
"LearnMoreFaceIDKey" = "Ďalšie informácie o Face ID";

/* The button title to enable Touch ID authentication. */
"EnableKey" = "Aktivovať";

/* The message displayed when authticate with Touch ID. */
"AuthWithTouchIDKey" = "Overiť s Touch ID";

/* The message displayed when authticate with Face ID. */
"AuthWithFaceIDKey" = "Overiť s Face ID";

/* The title on the navigation bar. */
"TouchIDErrorNavigationTitleKey" = "Chyba";

/* The error title. */
"AuthenticationErrorKey" = "Chyba overenia";

/* The error message for Touch ID devices. */
"AuthenticationTouchIDMessageKey" = "Ak chcete použiť aplikáciu, vykonajte overenie pomocou Touch ID.";

/* The error message for Face ID devices. */
"AuthenticationFaceIDMessageKey" = "Ak chcete použiť aplikáciu, vykonajte overenie pomocou Face ID.";

/* The authenticate button text. */
"AuthenticateKey" = "Overiť";

/* The message when the passcode entered in confirm passcode screen\n does not match with the one entered in the setup passcode screen. */
"PasscodeNotMatchKey" = "Prístupové kódy sa nezhodujú. Skúste to znova.";

/* The message format to be displayed when user entered wrong passcode\n and the remaining number of retries is greater than 1. */
"AttemptsLeftKey" = "Zostalo vám %d pokusov.";

/* The message format to be displayed when user entered wrong passcode\n and there is only one remaining retry. */
"OneAttemptLeftKey" = "Zostal vám 1 pokus.";

/* The first paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"MaxAttemptsReachedKey" = "Nezostali vám žiadne pokusy.";

/* The second paragraph of the alert message when the number user entered\n wrong passcode reached maximum allowed. */
"EnterCredentialsKey" = "Ak chcete obnoviť prístupový kód, prihláste sa.";

/* The text of the dismiss button on the alert. */
"OKKey" = "OK";

/* The message on the passcode screen when user entered wrong passcode\n and there is no limit on the number of retries. */
"RetryPasscodeKey" = "Nesprávny prístupový kód. Skúste to znova.";

/* The scan page title string. */
"ScanKey" = "Skenovať";

/* The title of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"ScanUnsuccessfulKey" = "Skenovanie bolo neúspešné";

/* The second line of the pop-up message when user selected a QR code photo\n which did not have a valid QR code. */
"SelectAnotherImageKey" = "Vyberte obrázok QR kódu.";

/* The title of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"InvalidQRCodeKey" = "Neplatný QR kód";

/* The second line of the pop-up message when user successfully got a QR code for\n onboarding activation but this QR code was not recognized by system. */
"QRCodeNotRecognizedKey" = "QR kód nebol rozpoznaný.";

/* The title of the alert to request photo access. */
"AllowPhotoAccessKey" = "Povoliť prístup k fotografiám";

/* The message of the alert to request photo access. */
"GiveAccessToPhotoSettingsKey" = "Ak chcete vybrať obrázok QR kódu, poskytnite prístup k svojim fotografiám v nastaveniach  ochrany osobných údajov v zariadení.";

/* The title of the alert to request camera access. */
"AllowCameraAccessKey" = "Povoliť prístup ku kamere";

/* The message of the alert to request camera access. */
"GiveAccessToCameraSettingsKey" = "Ak chcete skenovať pomocou kamery, umožnite prístup ku kamere v nastaveniach ochrany osobných údajov zariadenia vo vašom zariadení.";

/* *\n The alert action title to go to Settings app. */
"SettingsKey" = "Nastavenia";

/* The title string for the QR code scan confirmation screen. */
"ConfirmationKey" = "Potvrdenie";

/* The success message for the QR code scan confirmation screen. */
"ScanSucceededKey" = "Skenovanie bolo úspešné: Budete pripojení k: ";

/* The title string for the \"Continue\" button */
"ContinueKey" = "Pokračovať";

/* The title string for the back bar button on activation screen */
"BackBarButtonForActivationScreenKey" = "Spustiť";

/* FUIActivation Screen - headlineLabel */
"FUIActivationScreen_headlineLabel" = "Aktivácia";

/* FUIActivation Screen - detailLabel */
"FUIActivationScreen_detailLabel" = "Ak ste dostali uvítací e-mail, postupujte podľa aktivačného prepojenia v e-maili. V opačnom prípade zadajte svoju e-mailovú adresu alebo naskenujte QR kód, aby ste mohli začať s aktiváciou.";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_primaryActionButtonTitle" = "Ďalej";

/* FUIActivation Screen - subheadlineLabel */
"FUIActivationScreen_subheadlineLabel" = "Alebo";

/* FUIActivation Screen - primaryActionButton Title */
"FUIActivationScreen_secondaryActionButtonTitle" = "Skenovať";

/* FUIEULAView Screen - agree button */
"AgreeKey" = "Súhlasiť";

/* FUIEULAView Screen - disagree button */
"DisagreeKey" = "Nesúhlasiť";

/* The authentication title. */
"AuthenticationKey" = "Autentifikácia";

/* The basic authentication message. */
"basicAuthenticationMessageKey" = "Pre autentifikáciu zadajte svoje meno používateľa a heslo.";

/* Username input field placeholder string */
"usernameKey" = "meno používateľa";

/* Password input field placeholder string */
"passwordKey" = "heslo";

/* Sign In button string. */
"SignInKey" = "Prihlásiť sa";

/* Error message when failed to sign in. */
"SignInErrorKey" = "Nesprávne poverenia. Skúste to znova.";

/* The dynamic authentication message. */
"DynamicAuthenticationMessageKey" = "Ak chcete spustiť proces aktivácie, zadajte nižšie uvedené informácie.";

/* The message displayed on the banner when verifying information user entered. */
"VerifyingMessageKey" = "Overujú sa informácie...";

/* Cancel button string. */
"CancelKey" = "Zrušiť";

/* Allow button string. */
"AllowKey" = "Povoliť";

/* Deny button string. */
"DenyKey" = "Odmietnuť";

/* No button string. */
"NoKey" = "Nie";

/* Quit button string. */
"QuitKey" = "Skončiť";

/* GiveConsent button string. */
"GiveConsentKey" = "Dať súhlas";

/* Navbar title string. */
"StepKey" = "Krok";

/* Navbar title string. */
"OfKey" = "z";

/* CancelConfirmation message string. */
"CancelConfirmationKey" = "Naozaj chcete ukončiť proces aktivácie?";

/* MandatoryMessage button string. */
"MandatoryMessageKey" = "Bez súhlasu nebudete môcť pokračovať v aktivácii.";

/* Switch User button string. */
"SwitchOrAddUserKey" = "Prepnite alebo pridajte používateľa";

/* Title for Log In button */
"LogInKey" = "Prihlásiť sa";

/* Placeholder text in search bar for searching users in multi-user login controller */
"SearchUsersKey" = "Hľadať používateľov na tomto zariadení";

/* The button title for forgot passcode. */
"ForgotPasscodeKey" = "Zabudli ste prístupový kód?";

